# Day 12

# Pandas

pandas main focues for analyse , clean , mutate data.

In [ ]:
# use cases of pandas 
# Data Cleaning
# Data Analysis
# Data transformation
# Data Visualization
# Data Aggregation
# file handling
# Data Filtering and Selection
# Time Series Analysis

# Panda Series

A series is a one-dimensional labeled array capable of holding any data type. The axis labels are collectively called the index.

In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\thean\appdata\roaming\python\python313\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\thean\appdata\roaming\python\python313\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\thean\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\thean\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\thean\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\thean\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import numpy as np
import pandas as pd

In [4]:
labels = ["a","b","c"]
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {1:10,2:20,3:30}

In [5]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(d)

1    10
2    20
3    30
dtype: int64

# DataFrame

-> When you combine multiple series together

In [11]:
# Creating a dataframe
data = {
    'Name':["john","Anna","peter","linda"],
    'Age' :[28,34,29,42],
    'city' : ["New York", "Paris", "Berlin", "London"],
    'Salary' : [65000, 7000, 6200, 85000]
}
pd.DataFrame(data)

    Name  Age      city  Salary
0   john   28  New York   65000
1   Anna   34     Paris    7000
2  peter   29    Berlin    6200
3  linda   42    London   85000